//  M E S T O   -   O O P

// Поработайте с функциональностью работы карточек и валидации форм.
// Всю валидацию форм вы до этого писали в отдельном файле, а работу карточек — в другом.
// Теперь преобразуйте функции, которые существовали ранее, в единое целое — классы Card и FormValidator.
// В этом пункте задания поговорим про класс Card.
// Организуйте в классе Card код, который создаёт карточку с текстом и ссылкой на изображение:

// - принимает в конструктор её данные и селектор её template-элемента;
// - содержит приватные методы, которые работают с разметкой, устанавливают слушателей событий;
// - содержит приватные методы для каждого обработчика;
// - содержит один публичный метод, который возвращает полностью работоспособный и наполненный данными элемент карточки.
// Для каждой карточки создайте экземпляр класса Card. Когда дойдёте до реализации классов Popup,
// свяжите класс Card c попапом. Сделайте так, чтобы Card принимал в конструктор функцию handleCardClick.
// При клике на карточку эта функция должна открывать попап с картинкой.

